reports/stage3/async/wrkLogsGet.txt
Running 25s test @ http://localhost:8080
  1 threads and 65 connections
  Thread calibration: mean lat.: 4.507ms, rate sampling interval: 21ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.40ms    8.20ms  86.85ms   93.54%
    Req/Sec     6.15k   636.29    10.30k    84.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.14ms
 75.000%    3.40ms
 90.000%    7.77ms
 99.000%   49.22ms
 99.900%   71.04ms
 99.990%   80.45ms
 99.999%   85.38ms
100.000%   86.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.174     0.000000            1         1.00
       1.001     0.100000         8806         1.11
       1.294     0.200000        17644         1.25
       1.554     0.300000        26443         1.43
       1.829     0.400000        35237         1.67
       2.143     0.500000        44065         2.00
       2.321     0.550000        48469         2.22
       2.517     0.600000        52871         2.50
       2.741     0.650000        57252         2.86
       3.025     0.700000        61656         3.33
       3.401     0.750000        66042         4.00
       3.653     0.775000        68240         4.44
       4.001     0.800000        70446         5.00
       4.447     0.825000        72651         5.71
       5.115     0.850000        74846         6.67
       6.111     0.875000        77048         8.00
       6.795     0.887500        78147         8.89
       7.771     0.900000        79251        10.00
       8.983     0.912500        80348        11.43
      10.815     0.925000        81453        13.33
      13.047     0.937500        82551        16.00
      14.351     0.943750        83099        17.78
      16.023     0.950000        83649        20.00
      18.479     0.956250        84202        22.86
      21.983     0.962500        84751        26.67
      26.687     0.968750        85300        32.00
      28.943     0.971875        85576        35.56
      30.911     0.975000        85852        40.00
      32.959     0.978125        86131        45.71
      36.095     0.981250        86403        53.33
      40.927     0.984375        86676        64.00
      43.263     0.985938        86814        71.11
      45.471     0.987500        86951        80.00
      47.967     0.989062        87088        91.43
      50.175     0.990625        87229       106.67
      53.279     0.992188        87365       128.00
      55.007     0.992969        87432       142.22
      56.799     0.993750        87501       160.00
      58.527     0.994531        87572       182.86
      60.511     0.995313        87640       213.33
      62.271     0.996094        87709       256.00
      63.455     0.996484        87744       284.44
      64.575     0.996875        87776       320.00
      65.503     0.997266        87812       365.71
      66.751     0.997656        87847       426.67
      68.031     0.998047        87882       512.00
      68.223     0.998242        87897       568.89
      68.927     0.998437        87915       640.00
      69.631     0.998633        87931       731.43
      70.143     0.998828        87948       853.33
      71.295     0.999023        87966      1024.00
      71.551     0.999121        87974      1137.78
      72.639     0.999219        87983      1280.00
      73.343     0.999316        87991      1462.86
      74.431     0.999414        88000      1706.67
      75.455     0.999512        88009      2048.00
      75.647     0.999561        88013      2275.56
      76.479     0.999609        88018      2560.00
      76.863     0.999658        88021      2925.71
      77.119     0.999707        88026      3413.33
      77.887     0.999756        88030      4096.00
      78.079     0.999780        88032      4551.11
      78.527     0.999805        88034      5120.00
      78.719     0.999829        88036      5851.43
      79.679     0.999854        88039      6826.67
      80.447     0.999878        88042      8192.00
      80.447     0.999890        88042      9102.22
      80.703     0.999902        88043     10240.00
      81.919     0.999915        88044     11702.86
      81.983     0.999927        88045     13653.33
      82.751     0.999939        88046     16384.00
      83.135     0.999945        88047     18204.44
      83.135     0.999951        88047     20480.00
      83.775     0.999957        88048     23405.71
      83.775     0.999963        88048     27306.67
      84.735     0.999969        88049     32768.00
      84.735     0.999973        88049     36408.89
      84.735     0.999976        88049     40960.00
      85.375     0.999979        88050     46811.43
      85.375     0.999982        88050     54613.33
      85.375     0.999985        88050     65536.00
      85.375     0.999986        88050     72817.78
      85.375     0.999988        88050     81920.00
      86.911     0.999989        88051     93622.86
      86.911     1.000000        88051          inf
#[Mean    =        4.397, StdDeviation   =        8.203]
#[Max     =       86.848, Total count    =        88051]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.25ms
 75.000%    2.49ms
 90.000%    6.74ms
 99.000%   13.76ms
 99.900%   17.65ms
 99.990%   20.40ms
 99.999%   29.79ms
100.000%   32.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.081     0.000000            1         1.00
       0.445     0.100000         8822         1.11
       0.623     0.200000        17611         1.25
       0.790     0.300000        26420         1.43
       1.009     0.400000        35249         1.67
       1.251     0.500000        44040         2.00
       1.400     0.550000        48439         2.22
       1.574     0.600000        52849         2.50
       1.790     0.650000        57239         2.86
       2.105     0.700000        61650         3.33
       2.493     0.750000        66050         4.00
       2.803     0.775000        68251         4.44
       3.197     0.800000        70449         5.00
       3.679     0.825000        72644         5.71
       4.355     0.850000        74851         6.67
       5.291     0.875000        77045         8.00
       5.955     0.887500        78146         8.89
       6.743     0.900000        79249        10.00
       7.555     0.912500        80349        11.43
       8.287     0.925000        81452        13.33
       8.959     0.937500        82561        16.00
       9.287     0.943750        83100        17.78
       9.663     0.950000        83654        20.00
      10.103     0.956250        84202        22.86
      10.655     0.962500        84755        26.67
      11.311     0.968750        85308        32.00
      11.575     0.971875        85580        35.56
      11.879     0.975000        85854        40.00
      12.231     0.978125        86127        45.71
      12.591     0.981250        86407        53.33
      12.983     0.984375        86687        64.00
      13.167     0.985938        86816        71.11
      13.383     0.987500        86956        80.00
      13.615     0.989062        87093        91.43
      13.871     0.990625        87227       106.67
      14.175     0.992188        87368       128.00
      14.359     0.992969        87435       142.22
      14.527     0.993750        87502       160.00
      14.751     0.994531        87570       182.86
      15.055     0.995313        87641       213.33
      15.319     0.996094        87708       256.00
      15.479     0.996484        87742       284.44
      15.703     0.996875        87776       320.00
      15.879     0.997266        87811       365.71
      16.135     0.997656        87846       426.67
      16.447     0.998047        87880       512.00
      16.639     0.998242        87899       568.89
      16.943     0.998437        87915       640.00
      17.135     0.998633        87931       731.43
      17.423     0.998828        87949       853.33
      17.695     0.999023        87968      1024.00
      17.791     0.999121        87974      1137.78
      17.919     0.999219        87985      1280.00
      18.047     0.999316        87991      1462.86
      18.319     0.999414        88000      1706.67
      18.559     0.999512        88009      2048.00
      18.671     0.999561        88013      2275.56
      18.815     0.999609        88017      2560.00
      18.943     0.999658        88021      2925.71
      19.055     0.999707        88027      3413.33
      19.343     0.999756        88030      4096.00
      19.551     0.999780        88032      4551.11
      19.631     0.999805        88034      5120.00
      19.775     0.999829        88036      5851.43
      19.887     0.999854        88039      6826.67
      19.983     0.999878        88041      8192.00
      20.399     0.999890        88042      9102.22
      20.895     0.999902        88043     10240.00
      21.935     0.999915        88044     11702.86
      22.063     0.999927        88045     13653.33
      22.591     0.999939        88046     16384.00
      24.351     0.999945        88047     18204.44
      24.351     0.999951        88047     20480.00
      25.311     0.999957        88048     23405.71
      25.311     0.999963        88048     27306.67
      29.567     0.999969        88049     32768.00
      29.567     0.999973        88049     36408.89
      29.567     0.999976        88049     40960.00
      29.791     0.999979        88050     46811.43
      29.791     0.999982        88050     54613.33
      29.791     0.999985        88050     65536.00
      29.791     0.999986        88050     72817.78
      29.791     0.999988        88050     81920.00
      32.863     0.999989        88051     93622.86
      32.863     1.000000        88051          inf
#[Mean    =        2.416, StdDeviation   =        2.998]
#[Max     =       32.832, Total count    =        88051]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149066 requests in 25.00s, 9.24MB read
Requests/sec:   5962.25
Transfer/sec:    378.46KB